benchbnb/app/models/user.rb

  def self.find_by_credentials(credential, password)
    if URI::MailTo::EMAIL_REGEXP.match?(credential)
      email = credential
      user = User.find_by(email: email)
    else
      username = credential
      user = User.find_by(username: username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Demo-lition"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = generate_unique_session_token
    self.update!(session_token: session_token)
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-03-28 02:50:09.418911"], ["id", 1]]